src/test/resources/requests/PushDataArray.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rail="http://rail.push.ws.nicbase.com/">
   <soapenv:Header />
   <soapenv:Body>
      <rail:PushDataArray>
         <pushData>
            <assetId>4711</assetId>
            <assetIdProvider>d123456789</assetIdProvider>
            <assetName>3780 4993 602-1</assetName>
            <boxData>
               <boxId>vh47112561</boxId>
               <timestamp>2016-08-20T08:11:30.500Z</timestamp>
               <timeReceived>2016-08-21T08:11:30.500Z</timeReceived>
               <moveCount>400</moveCount>
               <stopCount>399</stopCount>
               <moveState>DRIVING</moveState>
               <movementChange>START_DRIVING</movementChange>
               <voltage>12.4</voltage>
               <energyConsumption>1.2</energyConsumption>
               <remainingBatteryCapacity>85</remainingBatteryCapacity>
               <remainingBatteryLifetime>423</remainingBatteryLifetime>
               <derailed>false</derailed>
               <uTurnDetected>false</uTurnDetected>
               <errorCode>J23H</errorCode>
               <gpsData>
                  <timestamp>2016-08-22T08:11:30.411Z</timestamp>
                  <latitude>13.123456</latitude>
                  <longitude>10.123456</longitude>
                  <height>168</height>
                  <direction>15</direction>
                  <heading>15</heading>
                  <distance>1532.17</distance>
                  <totalDistance>1532654.2</totalDistance>
                  <speed>32.5</speed>
                  <satellites>7</satellites>
                  <hdop>7</hdop>
                  <positioningDevice>GPS_GSM</positioningDevice>
               </gpsData>
               <locationData>
                  <timestamp>2016-08-23T08:11:30.411Z</timestamp>
                  <street>An der Stiftsbleiche</street>
                  <streetNumber>11</streetNumber>
                  <zipCode>87439</zipCode>
                  <city>Kempten</city>
                  <country>Deutschland</country>
                  <isoCountryCode>DE</isoCountryCode>
                  <uicCountryCode>80</uicCountryCode>
               </locationData>
               <sensorData>
                  <timestamp>2016-08-24T08:11:30.411Z</timestamp>
                  <sensorId>1212</sensorId>
                  <sensorDescription>Project Z Testsensor 1</sensorDescription>
                  <sensorType>TEMPERATURE</sensorType>
                  <value>14.33</value>
               </sensorData>
               <sensorData>
                  <timestamp>2016-08-25T08:11:30.411Z</timestamp>
                  <sensorId>1313</sensorId>
                  <sensorDescription>Project Z Testsensor 2</sensorDescription>
                  <sensorType>HUMIDITY</sensorType>
                  <value>12.12</value>
                  <thresholdValue>10.00</thresholdValue>
                  <thresholdCrossed>HIGH_TO_LOW</thresholdCrossed>
               </sensorData>
               <loadingData>
                  <timestamp>2016-08-26T08:11:30.411Z</timestamp>
                  <loaded>true</loaded>
                  <overloaded>true</overloaded>
                  <weighing>12000</weighing>
               </loadingData>
               <shockData>
                  <timestamp>2016-08-27T08:11:30.411Z</timestamp>
                  <shockAxis>X</shockAxis>
                  <shockAmplitude>6.6</shockAmplitude>
                  <shockDuration>1.3</shockDuration>
                  <shocksTotal>1</shocksTotal>
                  <shockAmplitudesMax>3.1</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-08-28T08:11:30.411Z</timestamp>
                  <shockAxis>Y</shockAxis>
                  <shockAmplitude>4.6</shockAmplitude>
                  <shockDuration>0.3</shockDuration>
                  <shocksTotal>5</shocksTotal>
                  <shockAmplitudesMax>2.2</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-08-29T08:11:30.411Z</timestamp>
                  <shockAxis>Z</shockAxis>
                  <shockAmplitude>5.6</shockAmplitude>
                  <shockDuration>2.3</shockDuration>
                  <shocksTotal>3</shocksTotal>
                  <shockAmplitudesMax>1.2</shockAmplitudesMax>
               </shockData>
            </boxData>
         </pushData>
         <pushData>
            <assetId>4712</assetId>
            <assetIdProvider>987654321</assetIdProvider>
            <assetName>3780 4993 602-2</assetName>
            <boxData>
               <boxId>vh47112562</boxId>
               <timestamp>2016-07-20T08:11:30.500Z</timestamp>
               <timeReceived>2016-07-21T08:11:30.500Z</timeReceived>
               <moveCount>500</moveCount>
               <stopCount>499</stopCount>
               <moveState>STANDING</moveState>
               <movementChange>START_STANDING</movementChange>
               <voltage>12.4</voltage>
               <energyConsumption>1.2</energyConsumption>
               <remainingBatteryCapacity>85</remainingBatteryCapacity>
               <remainingBatteryLifetime>423</remainingBatteryLifetime>
               <derailed>true</derailed>
               <uTurnDetected>true</uTurnDetected>
               <errorCode>J23H</errorCode>
               <gpsData>
                  <timestamp>2016-07-22T08:11:30.411Z</timestamp>
                  <latitude>13.123456</latitude>
                  <longitude>10.123456</longitude>
                  <height>168</height>
                  <direction>15</direction>
                  <heading>15</heading>
                  <distance>1532.17</distance>
                  <totalDistance>1532654.11</totalDistance>
                  <speed>32.5</speed>
                  <satellites>7</satellites>
                  <hdop>7.1</hdop>
                  <positioningDevice>GPS_GSM</positioningDevice>
               </gpsData>
               <locationData>
                  <timestamp>2016-07-23T08:11:30.411Z</timestamp>
                  <street>An der Stiftsbleiche</street>
                  <streetNumber>11</streetNumber>
                  <zipCode>87439</zipCode>
                  <city>Kempten</city>
                  <country>Deutschland</country>
                  <isoCountryCode>DE</isoCountryCode>
                  <uicCountryCode>80</uicCountryCode>
               </locationData>
               <sensorData>
                  <timestamp>2016-07-24T08:11:30.411Z</timestamp>
                  <sensorId>1414</sensorId>
                  <sensorDescription>Project Z Testsensor 3</sensorDescription>
                  <sensorType>PRESSURE</sensorType>
                  <value>14.33</value>
               </sensorData>
               <loadingData>
                  <timestamp>2016-07-26T08:11:30.411Z</timestamp>
                  <loaded>true</loaded>
                  <overloaded>false</overloaded>
                  <weighing>10000</weighing>
               </loadingData>
               <shockData>
                  <timestamp>2016-07-27T08:11:30.411Z</timestamp>
                  <shockAxis>X</shockAxis>
                  <shockAmplitude>6.6</shockAmplitude>
                  <shockDuration>1.3</shockDuration>
                  <shocksTotal>1</shocksTotal>
                  <shockAmplitudesMax>3.1</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-07-28T08:11:30.411Z</timestamp>
                  <shockAxis>Y</shockAxis>
                  <shockAmplitude>4.6</shockAmplitude>
                  <shockDuration>0.3</shockDuration>
                  <shocksTotal>5</shocksTotal>
                  <shockAmplitudesMax>2.2</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-07-29T08:11:30.411Z</timestamp>
                  <shockAxis>Z</shockAxis>
                  <shockAmplitude>5.6</shockAmplitude>
                  <shockDuration>2.3</shockDuration>
                  <shocksTotal>3</shocksTotal>
                  <shockAmplitudesMax>1.2</shockAmplitudesMax>
               </shockData>
            </boxData>
            <boxData>
               <boxId>vh47112563</boxId>
               <timestamp>2016-06-20T08:11:30.500Z</timestamp>
               <timeReceived>2016-06-21T08:11:30.500Z</timeReceived>
               <moveCount>500</moveCount>
               <stopCount>499</stopCount>
               <moveState>PARKING</moveState>
               <movementChange>START_PARKING</movementChange>
               <voltage>12.4</voltage>
               <energyConsumption>1.2</energyConsumption>
               <remainingBatteryCapacity>85</remainingBatteryCapacity>
               <remainingBatteryLifetime>423</remainingBatteryLifetime>
               <derailed>false</derailed>
               <uTurnDetected>false</uTurnDetected>
               <errorCode>J23H</errorCode>
               <gpsData>
                  <timestamp>2016-06-22T08:11:30.411Z</timestamp>
                  <latitude>13.123456</latitude>
                  <longitude>10.123456</longitude>
                  <height>168</height>
                  <direction>15</direction>
                  <heading>15</heading>
                  <distance>1532.17</distance>
                  <totalDistance>1532654.11</totalDistance>
                  <speed>32.5</speed>
                  <satellites>7</satellites>
                  <hdop>7</hdop>
                  <positioningDevice>GPS_GSM</positioningDevice>
               </gpsData>
               <locationData>
                  <timestamp>2016-06-23T08:11:30.411Z</timestamp>
                  <street>An der Stiftsbleiche</street>
                  <streetNumber>11</streetNumber>
                  <zipCode>87439</zipCode>
                  <city>Kempten</city>
                  <country>Deutschland</country>
                  <isoCountryCode>DE</isoCountryCode>
                  <uicCountryCode>80</uicCountryCode>
               </locationData>
               <sensorData>
                  <timestamp>2016-06-24T08:11:30.411Z</timestamp>
                  <sensorId>1515</sensorId>
                  <sensorDescription>Project Z Testsensor 4</sensorDescription>
                  <sensorType>TEMPERATURE</sensorType>
                  <value>14.33</value>
               </sensorData>
               <loadingData>
                  <timestamp>2016-06-26T08:11:30.411Z</timestamp>
                  <loaded>false</loaded>
                  <overloaded>false</overloaded>
                  <weighing>10000</weighing>
               </loadingData>
               <shockData>
                  <timestamp>2016-06-27T08:11:30.411Z</timestamp>
                  <shockAxis>X</shockAxis>
                  <shockAmplitude>6.6</shockAmplitude>
                  <shockDuration>1.3</shockDuration>
                  <shocksTotal>1</shocksTotal>
                  <shockAmplitudesMax>3.1</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-06-28T08:11:30.411Z</timestamp>
                  <shockAxis>Y</shockAxis>
                  <shockAmplitude>4.6</shockAmplitude>
                  <shockDuration>0.3</shockDuration>
                  <shocksTotal>5</shocksTotal>
                  <shockAmplitudesMax>2.2</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <timestamp>2016-06-29T08:11:30.411Z</timestamp>
                  <shockAxis>Z</shockAxis>
                  <shockAmplitude>5.6</shockAmplitude>
                  <shockDuration>2.3</shockDuration>
                  <shocksTotal>3</shocksTotal>
                  <shockAmplitudesMax>1.2</shockAmplitudesMax>
               </shockData>
            </boxData>
         </pushData>
      </rail:PushDataArray>
   </soapenv:Body>
</soapenv:Envelope>